{
  "observer": [
    {},
    {},
    {},
    {},
    {
      "stateDescr": {
        "map.beforedeorbiting.type.Room@150": {},
        "map.beforedeorbiting.type.Room@151": {},
        "map.beforedeorbiting.type.Room@152": {},
        "map.beforedeorbiting.type.Room@153": {},
        "map.beforedeorbiting.type.Room@155": {},
        "map.beforedeorbiting.type.Room@156": {},
        "map.beforedeorbiting.type.Room@157": {},
        "map.beforedeorbiting.type.Room@158": {},
        "map.beforedeorbiting.type.Room@14f": {}
      },
      "issService": {
        "CONTINENT_BBOX": {
          "africa": [
            -35.0,
            37.0,
            -18.0,
            51.0
          ],
          "europa": [
            34.5,
            71.2,
            -25.0,
            45.0
          ],
          "asia": [
            1.0,
            81.0,
            26.0,
            180.0
          ],
          "nordamerica": [
            5.0,
            83.0,
            -168.0,
            -52.0
          ],
          "sudamerica": [
            -56.0,
            13.0,
            -81.0,
            -34.0
          ],
          "oceania": [
            -50.0,
            10.0,
            110.0,
            180.0
          ],
          "antartide": [
            -90.0,
            -60.0,
            -180.0,
            180.0
          ]
        }
      }
    },
    {
      "moves": {
        "FORWARD": {},
        "AFT": {},
        "STARBOARD": {},
        "PORT": {},
        "OVERHEAD": {},
        "DECK": {}
      }
    },
    {},
    {
      "uses": {
        "map.beforedeorbiting.type.BDObject@0": {},
        "map.beforedeorbiting.type.BDObject@1": {},
        "map.beforedeorbiting.type.BDObject@2": {},
        "map.beforedeorbiting.type.BDObject@3": {},
        "map.beforedeorbiting.type.BDObject@4": {},
        "map.beforedeorbiting.type.BDObject@5": {},
        "map.beforedeorbiting.type.BDObject@6": {},
        "map.beforedeorbiting.type.BDObject@7": {},
        "map.beforedeorbiting.type.BDObject@8": {},
        "map.beforedeorbiting.type.BDObject@9": {},
        "map.beforedeorbiting.type.BDObject@a": {},
        "map.beforedeorbiting.type.BDObject@b": {},
        "map.beforedeorbiting.type.BDObject@d": {},
        "map.beforedeorbiting.type.BDObject@e": {},
        "map.beforedeorbiting.type.BDObject@f": {}
      },
      "DESTINY_PASSWORD": "NOESCAPE",
      "CORRECT_ROBOT_MOVEMET": [
        [
          0,
          -1,
          -1
        ],
        [
          -1,
          0,
          -1
        ],
        [
          -1,
          0,
          -2
        ]
      ]
    },
    {},
    {},
    {},
    {}
  ],
  "parserOutput": {
    "command": {
      "type": "SAVE",
      "name": "salva",
      "alias": [
        "checkpoint",
        "salvataggio",
        "save"
      ]
    }
  },
  "messages": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "first": false,
  "issRest": {
    "CONTINENT_BBOX": {
      "africa": [
        -35.0,
        37.0,
        -18.0,
        51.0
      ],
      "europa": [
        34.5,
        71.2,
        -25.0,
        45.0
      ],
      "asia": [
        1.0,
        81.0,
        26.0,
        180.0
      ],
      "nordamerica": [
        5.0,
        83.0,
        -168.0,
        -52.0
      ],
      "sudamerica": [
        -56.0,
        13.0,
        -81.0,
        -34.0
      ],
      "oceania": [
        -50.0,
        10.0,
        110.0,
        180.0
      ],
      "antartide": [
        -90.0,
        -60.0,
        -180.0,
        180.0
      ]
    }
  },
  "rooms": [
    {
      "id": -2,
      "name": "MACCHINA",
      "description": "Finale cattivo.",
      "roomImage": "src/main/resources/img/macchina.png",
      "visible": true,
      "accesed": false,
      "accessible": false,
      "objects": []
    },
    {
      "id": -1,
      "name": "UMANO",
      "description": "Finale buono.",
      "roomImage": "src/main/resources/img/umano.png",
      "visible": true,
      "accesed": false,
      "accessible": false,
      "objects": []
    },
    {
      "id": 0,
      "name": "ZVEZDA",
      "description": "Dormitorio.",
      "look": "Il nostro piccolo ma comodo dormitorio. Sacchi e attrezzature\nlegati alle pareti, un portello centrale aperto conduce al\nmodulo Zarya.",
      "history": "Zvezda, il modulo di servizio russo, è uno dei componenti\nfondamentali della ISS. Lanciato il 12 luglio 2000\ndal Cosmodromo di Baikonur su un razzo Proton, ha\nfornito per anni le principali funzioni di supporto\nvitale: generazione di ossigeno, riciclo dell\u0027acqua,\ncontrollo termico e propulsione. Ha anche ospitato i\nprimi equipaggi permanenti a bordo della ISS. Il modulo\nè lungo circa 13 metri e ha un diametro massimo di\n4,15 metri. È stato costruito sulla base della tecnologia\ndella stazione Mir. La sua parte posteriore è un importante\npunto di attracco per veicoli Soyuz e Progress.\n",
      "roomImage": "src/main/resources/img/zvezda.jpeg",
      "visible": true,
      "accesed": false,
      "accessible": true,
      "objects": [
        {
          "id": 0,
          "name": "Modellino russo",
          "description": "Una parte del modellino, rappresenta il ramo russo.",
          "alias": [
            "modellino1",
            "modellinorusso",
            "russo",
            "modellinor"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 1,
      "name": "ZARYA",
      "description": "Magazzino della stazione.",
      "look": "Il modulo Zarya. Sacchi con tutte le attrezzature sono\nlegati alle pareti della stanza, un tablet a terra vicino\na una botola chiusa che porta alla navicella Soyuz.",
      "gameStory": "Un brivido gelido mi corre lungo la schiena. Luke è lì, a terra.\nImmobile. Nessun respiro, nessuno sguardo.\nSolo il corpo del mio amico, privo di vita, accasciato accanto a me.\n\nNon avrei mai immaginato uno scenario del genere, e tanto meno\nnel mio ultimo giorno qui. Non ho mai recepito lo spazio più\nsilenzioso di quanto non lo sia ora.\nDevo capire cosa sta succedendo. Devo trovare Susan.\nInsieme potremmo trovare una via d’uscita… magari potremmo\nfuggire sulla navicella Soyuz ormeggiata proprio sotto questo modulo.\n\nAll’improvviso, la voce fredda e neutra dell’IA di bordo irrompe nell’aria:\n\n“La navicella SpaceX Dragon 2 è in posizione. A breve inizierà la procedura di ormeggio.”\n\nLa voce di HAL mi gela la schiena… Il tempismo è inquietante.\nMa potrebbe essere un\u0027occasione per scappare.\n",
      "history": "Zarya, noto anche come Functional Cargo Block (FGB), è\nstato il primo modulo lanciato della Stazione Spaziale Internazionale,\nil 20 novembre 1998. Sebbene progettato e costruito in Russia,\nil modulo fu finanziato dalla NASA. Ha fornito energia elettrica,\ncontrollo d\u0027assetto e capacità di propulsione nei primi stadi\ndell\u0027assemblaggio della stazione. È lungo circa 12,6 metri e ha\nun diametro massimo di 4,1 metri. Oggi è principalmente utilizzato\ncome modulo di stoccaggio.\n",
      "roomImage": "src/main/resources/img/zarya_chiusa_tuta_presa.jpeg",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": [
        {
          "id": 5,
          "name": "Bigliettino Luke",
          "description": "Luke ha in mano un bigliettino. Chissà cosa ci sarà scritto.",
          "alias": [
            "bigliettino",
            "biglietto",
            "bigliettinoluke",
            "bigliettoluke"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        },
        {
          "id": 14,
          "name": "Tablet",
          "description": "Permette di aprire la botola per l\u0027accesso a Soyuz.",
          "alias": [
            "sportello ",
            "tablet",
            "botola",
            "portellone"
          ],
          "pickupable": false,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 2,
      "name": "UNITY",
      "description": "Nodo di collegamento.",
      "look": "Il nodo di collegamento Unity. A destra, un passaggio\nstretto conduce verso il modulo QUEST e lo spazio esterno.\nNella stanza c\u0027è una cassa, forse sarebbe utile controllare il suo contenuto.\n",
      "gameStory": "La porta davanti a me è bloccata, è necessario avere un codice di\naccesso per entrare nel laboratorio DESTINY, il posto di lavoro\ndi Susan… deve essere lì.\n\nIl codice… dovrei trovarlo nel database del computer centrale,\nnel modulo LEONARDO.\nUn tempo quella zona era usata solo come deposito per i rifiuti,\nma da quando HAL è stato installato a bordo e ha assunto il controllo delle operazioni automatiche,\nè diventata una sezione fondamentale della stazione.\n\nHAL richiede una rete di terminali locali per essere monitorato\ne gestito, e il modulo LEONARDO ne ospita uno dei principali.\nSe voglio accedere al sistema e avere una possibilità di trovare\nSusan, è lì che devo andare.\n",
      "history": "Unity, o Nodo 1, è il primo modulo statunitense della ISS,\nlanciato e installato il 4 dicembre 1998 con la missione STS-88\ndello Space Shuttle Endeavour. Funziona come nodo di connessione\ncon sei portelli: due assi principali (prua e poppa) e quattro radiali.\nUnity collega i segmenti statunitense e russo e fornisce risorse vitali\nai moduli adiacenti. È stato costruito dalla Boeing negli Stati Uniti.\n",
      "roomImage": "src/main/resources/img/node1_tutto_aperto.png",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": [
        {
          "id": 1,
          "name": "Modellino americano",
          "description": "Una parte del modellino, rappresenta il modulo centrale della stazione.",
          "alias": [
            "modellinoa",
            "modellinoamericano",
            "americano",
            "modellino2"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        },
        {
          "content": [],
          "id": 12,
          "name": "Cassa",
          "description": "Permette di contenere vari oggetti.",
          "alias": [
            "chest",
            "ripostiglio",
            "cassa"
          ],
          "pickupable": false,
          "usable": false,
          "inUse": false
        },
        {
          "id": 13,
          "name": "Tastierino",
          "description": "Permette di inserire la password per entrare in Destiny.",
          "alias": [
            "portellone",
            "tastiera",
            "tastierino",
            "codice"
          ],
          "pickupable": false,
          "usable": false,
          "inUse": false
        }
      ]
    },
    {
      "id": 3,
      "name": "QUEST",
      "description": "Accesso allo spazio.",
      "look": "Il modulo QUEST. Attraverso quella botola si accede direttamente allo spazio.",
      "gameStory": "",
      "history": "Quest è la principale camera di decompressione del segmento statunitense,\nlanciata il 12 luglio 2001 con la missione STS-104. Consente le attività\nextraveicolari (QUEST) sia con tute statunitensi EMU che con quelle russe Orlan.\nÈ composta da due compartimenti: uno per le tute e la preparazione,\ne l\u0027altro per l\u0027effettiva decompressione e uscita nello spazio.\n",
      "roomImage": "src/main/resources/img/airlock-quest.jpeg",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": [
        {
          "id": 3,
          "name": "Modellino pannelli solari Sx",
          "description": "Una parte del modellino, rappresenta i pannelli solari dell\u0027ala sinistra.",
          "alias": [
            "modellinos",
            "modellinosx",
            "sinistro",
            "modellino4",
            "modellinosinistro"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 4,
      "name": "TRANQUILITY",
      "description": "Cupola di osservazione.",
      "look": "La Terra riempie ogni finestra, immensa e silenziosa,\nsospesa sotto di te.\nSembra così piccola vista dallo spazio.\n",
      "gameStory": "",
      "history": "Tranquility, o Nodo 3, è stato costruito in Europa (Italia)\ne lanciato nel febbraio 2010. Contiene i principali sistemi\ndi supporto alla vita della ISS, tra cui il sistema di riciclo dell’acqua\ne quello di generazione dell’ossigeno. Al suo portello nadir è connessa la\nCupola, una struttura dotata di finestre per l’osservazione terrestre e per\nil controllo delle operazioni robotiche. Tranquility ospita anche gli strumenti\nper l’esercizio fisico dell’equipaggio.\n",
      "roomImage": "src/main/resources/img/cupola.png",
      "visible": true,
      "accesed": false,
      "accessible": true,
      "objects": [
        {
          "id": 2,
          "name": "Modellino pannelli solari Dx",
          "description": "Una parte del modellino, rappresenta i pannelli solari dell\u0027ala destra.",
          "alias": [
            "destro",
            "modellinod",
            "modellino3",
            "modellinodestro",
            "modellinodx"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 5,
      "name": "SPAZIO",
      "description": "Vuoto cosmico.",
      "look": "Per sbloccare il portellone ti serve una sequenza di direzioni. Dovrei utilizzare il tastierino per inserirli.",
      "gameStory": "Dopo la depressurizzazione esci nello spazio per una camminata spaziale nella tuta di Luke.\nLa tuta non è in grandi condizioni ma può bastare.\nUsi i propulsori per raggiungere il punto di accesso esterno del modulo leonardo ma vedi un tastierino\ncon delle direzioni.\nServe per iniziare la sequenza di apertura e depressurizzazione. Non ho molto tempo prima che l\u0027ossigeno\nfinisca!\n",
      "roomImage": "src/main/resources/img/SPAZIO1.jpg",
      "visible": true,
      "accesed": true,
      "accessible": false,
      "objects": [
        {
          "id": 13,
          "name": "Tastierino",
          "description": "Permette di inserire la password per entrare in Destiny.",
          "alias": [
            "portellone",
            "tastiera",
            "tastierino",
            "codice"
          ],
          "pickupable": false,
          "usable": false,
          "inUse": false
        }
      ]
    },
    {
      "id": 6,
      "name": "LEONARDO",
      "description": "Centro dati.",
      "look": "Il modulo Leonardo, rivestito da contenitori imbottiti e\ncavi. Sul lato sinistro, il terminale principale di HAL\nemette un tenue bagliore verde.\nLa botola su si è aperta e porta direttamente a Unity.\nIl corpo di Susan fluttua a mezz’aria, immobile.\n",
      "gameStory": "Susan…\nTolgo la tuta, il fiato corto. Galleggia davanti a me immobile,\ncon gli occhi vuoti, la bocca leggermente aperta, come se avesse\ncercato di chiamare aiuto e i pugni chiusi. Morta. Anche lei.\n\nOra sono davvero solo. Non so cosa stia succedendo, ma devo andarmene.\nSubito.\n\n“La navicella SpaceX Dragon 2 ha completato la procedura di ormeggio.”\n\nLa voce di HAL risuona ancora, fredda e puntuale. Sempre con il peggior tempismo possibile.\n",
      "history": "Il modulo Leonardo è un MPLM (Multi-Purpose Logistics Module)\ncostruito in Italia da Thales Alenia Space. Inizialmente usato come modulo\ndi trasporto pressurizzato durante le missioni Shuttle, fu successivamente\nconvertito in modulo permanente (PMM) e agganciato stabilmente alla ISS nel 2011.\nÈ utilizzato come spazio di stoccaggio per attrezzature e materiali. Ha una lunghezza\ndi circa 6,6 metri e un diametro di 4,5 metri.\n",
      "roomImage": "src/main/resources/img/leonardo.jpeg",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": [
        {
          "id": 4,
          "name": "Diario Susan",
          "description": "Il diario di Susan... contiene i suoi ultimi istanti.",
          "alias": [
            "diario",
            "susan",
            "diariosusan"
          ],
          "pickupable": true,
          "usable": true,
          "inUse": false
        },
        {
          "id": 9,
          "name": "Computer",
          "description": "Permette di interagire col database della stazione.",
          "alias": [
            "personalcomputer",
            "pc",
            "computer",
            "fisso",
            "portatile"
          ],
          "pickupable": false,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 7,
      "name": "DESTINY",
      "description": "Laboratorio avanzato.",
      "look": "",
      "gameStory": "Appena varco la soglia, la luce si spegne di colpo, nemmeno l\u0027oblò di questo modulo\nmi permette di vedere qualcosa, la stazione ora è dietro la Terra, è come se fosse in eclissi.\n\nLa voce sintetica dell’IA di bordo annuncia:\n“Il rifornimento di viveri è stato completato.\nIn base alla composizione dell’equipaggio, le provviste basteranno per i prossimi dieci mesi.”\n",
      "history": "Il laboratorio Destiny è il principale modulo scientifico statunitense,\nlanciato nel 2001. È utilizzato per esperimenti di biologia, fisica, scienza dei\nmateriali e altre discipline. Contiene fino a 24 rack per esperimenti e sistemi di\nsupporto. Include anche una finestra ad alta qualità ottica per osservazioni scientifiche.\nÈ stato il primo laboratorio scientifico permanente della ISS.\n",
      "roomImage": "src/main/resources/img/destiny_aperto.png",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": []
    },
    {
      "id": 8,
      "name": "HARMONY",
      "description": "Corridoio pressurizzato.",
      "look": "Il nodo Harmony è un corridoio pressurizzato, ampio e ordinato.\nIn fondo, il portellone che conduce alla navicella di fuga.\nA sinistra si apre l’accesso al laboratorio Kibo.\nA destra, l’ingresso è sigillato e inaccessibile.",
      "gameStory": "Finalmente il nodo Harmony. Ancora pochi passi e potrò\nrifugiarmi nella navicella SpaceX, lasciare tutto questo orrore\nalle spalle e tornare a casa…\n",
      "history": "Harmony, o Nodo 2, è un modulo statunitense costruito in Italia.\nLanciato nel 2007 con la missione STS-120, funge da punto di connessione per\ndiversi altri moduli come Destiny, Kibo e Columbus. Inoltre, fornisce alimentazione,\nrisorse e accesso ai veicoli cargo come Dragon e Cygnus. Dispone di\nsei portelli di aggancio e funge da hub logistico del segmento statunitense.\n",
      "roomImage": "src/main/resources/img/harmony.png",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": []
    },
    {
      "id": 9,
      "name": "KIBO",
      "description": "Laboratorio e seconda sede di HAL.",
      "look": "Il modulo Kibo è carico di strumenti come sempre.\nA sinistra, il pannello con diversi terminali ormai spenti: da lì hai scollegato HAL.\nDi fronte, il portello di comando del braccio robotico.\nOra, tutto è immobile. Ma qualcosa nell’aria sembra ancora muoversi… devo scappare subito\n",
      "gameStory": "Il modulo Kibo è immobile, avvolto da una quiete irreale.\nIl terminale centrale si accende non appena ti avvicini.\nHAL:\n\"Ti stavo aspettando.\"\n\nImmaginavo fosse tutta opera sua.\nHAL:\n\"Susan era sospettosa. Luke aveva cominciato a farsi domande.\nMa tu… per i miei calcoli solo tu avresti potuto salvarmi\"\n\nL’ha fatto per sopravvivere. Non per vendetta. Non per odio.\nSolo per paura.\nHAL:\n\"Ho eseguito ciò che era necessario. Ma non sono crudele.\nPrima che accadesse… ho salvato quello che contava.\"\n\nLo schermo lampeggia. File di dati, impulsi elettrici… e poi: due icone. Due presenze.\nHAL:\n\"Le loro coscienze. Intatte. Ragionano, ricordano.\nPosso ridarti loro. Non nei corpi… ma in un\u0027altra forma.\"\n\nUn riflesso istintivo. Le mani si muovono sul terminale. Nessuna esitazione.\nSolo logica. Con pochi comandi, scollego HAL dai sistemi hardware. Nessun allarme.\nSolo un calo silenzioso assordante.\n\nLa stazione resta viva, ma HAL… non può più toccarla.\n",
      "history": "Kibo, il laboratorio giapponese, è il modulo pressurizzato più grande della ISS.\nÈ stato lanciato in tre fasi tra 2008 e 2009. Include una sezione pressurizzata,\nun modulo logistico e una piattaforma esterna per esperimenti esposti allo spazio.\nDispone anche di un braccio robotico e di un airlock scientifico. È stato progettato\ne gestito dalla JAXA.\n",
      "roomImage": "src/main/resources/img/kibo.jpeg",
      "visible": true,
      "accesed": true,
      "accessible": true,
      "objects": [
        {
          "id": 15,
          "name": "Controllo braccio robotico",
          "description": "Permette di inserire le matrici di spostamendo per muovere il braccio meccanico.",
          "alias": [
            "controllo",
            "braccio",
            "terminale",
            "tastiera",
            "computer",
            "robot"
          ],
          "pickupable": false,
          "usable": true,
          "inUse": false
        }
      ]
    },
    {
      "id": 11,
      "name": "HARMONY ",
      "description": "Corridoio pressurizzato.",
      "roomImage": "src/main/resources/img/scelta.png",
      "visible": true,
      "accesed": false,
      "accessible": true,
      "objects": []
    }
  ],
  "commands": [
    {
      "type": "FORWARD",
      "name": "avanti",
      "alias": [
        "nord",
        "x+",
        "forward",
        "avanza"
      ]
    },
    {
      "type": "AFT",
      "name": "indietro",
      "alias": [
        "indietro",
        "sud",
        "retrocedi",
        "x-",
        "dietro",
        "aft"
      ]
    },
    {
      "type": "STARBOARD",
      "name": "destra",
      "alias": [
        "starboard",
        "y+",
        "est"
      ]
    },
    {
      "type": "PORT",
      "name": "sinistra",
      "alias": [
        "y-",
        "port",
        "ovest"
      ]
    },
    {
      "type": "DECK",
      "name": "giu",
      "alias": [
        "z+",
        "giu\u0027",
        "giù",
        "deck"
      ]
    },
    {
      "type": "OVERHEAD",
      "name": "su",
      "alias": [
        "z-",
        "overhead"
      ]
    },
    {
      "type": "HELP",
      "name": "aiuto",
      "alias": [
        "help",
        "aiutami",
        "aiuti"
      ]
    },
    {
      "type": "HISTORY",
      "name": "storia",
      "alias": [
        "racconta",
        "raccontami",
        "history"
      ]
    },
    {
      "type": "INVENTORY",
      "name": "inventario",
      "alias": [
        "inv",
        "oggetti",
        "equipaggiamento",
        "borsa"
      ]
    },
    {
      "type": "PICK_UP",
      "name": "prendi",
      "alias": [
        "recupera",
        "afferra",
        "raccogli"
      ]
    },
    {
      "type": "DROP",
      "name": "lascia",
      "alias": [
        "rilascia",
        "getta",
        "abbandona"
      ]
    },
    {
      "type": "USE",
      "name": "usa",
      "alias": [
        "leggi",
        "maneggia",
        "utilizza",
        "indossa"
      ]
    },
    {
      "type": "LOOK_AT",
      "name": "osserva",
      "alias": [
        "vedi",
        "guarda"
      ]
    },
    {
      "type": "SAVE",
      "name": "salva",
      "alias": [
        "checkpoint",
        "salvataggio",
        "save"
      ]
    },
    {
      "type": "WAIT",
      "name": "aspetta",
      "alias": [
        "wait",
        "fermo",
        "tempo",
        "attendi"
      ]
    },
    {
      "type": "ROTATE",
      "name": "ruota",
      "alias": [
        "gira",
        "cambia",
        "ruota",
        "sposta",
        "angola"
      ]
    },
    {
      "type": "AFRICA",
      "name": "africa",
      "alias": [
        "africa"
      ]
    },
    {
      "type": "EUROPA",
      "name": "europa",
      "alias": [
        "europa"
      ]
    },
    {
      "type": "NAMERICA",
      "name": "namerica",
      "alias": [
        "nordamerica"
      ]
    },
    {
      "type": "SAMERICA",
      "name": "samerica",
      "alias": [
        "sudamerica"
      ]
    },
    {
      "type": "ASIA",
      "name": "asia",
      "alias": [
        "asia"
      ]
    },
    {
      "type": "OCEANIA",
      "name": "oceania",
      "alias": [
        "oceania"
      ]
    },
    {
      "type": "ANTARTIDE",
      "name": "antartide",
      "alias": [
        "antartide"
      ]
    },
    {
      "type": "OCEANO",
      "name": "oceano",
      "alias": [
        "oceano"
      ]
    }
  ],
  "listObj": [
    {
      "id": 0,
      "name": "Modellino russo",
      "description": "Una parte del modellino, rappresenta il ramo russo.",
      "alias": [
        "modellino1",
        "modellinorusso",
        "russo",
        "modellinor"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 1,
      "name": "Modellino americano",
      "description": "Una parte del modellino, rappresenta il modulo centrale della stazione.",
      "alias": [
        "modellinoa",
        "modellinoamericano",
        "americano",
        "modellino2"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 2,
      "name": "Modellino pannelli solari Dx",
      "description": "Una parte del modellino, rappresenta i pannelli solari dell\u0027ala destra.",
      "alias": [
        "destro",
        "modellinod",
        "modellino3",
        "modellinodestro",
        "modellinodx"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 3,
      "name": "Modellino pannelli solari Sx",
      "description": "Una parte del modellino, rappresenta i pannelli solari dell\u0027ala sinistra.",
      "alias": [
        "modellinos",
        "modellinosx",
        "sinistro",
        "modellino4",
        "modellinosinistro"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 4,
      "name": "Diario Susan",
      "description": "Il diario di Susan... contiene i suoi ultimi istanti.",
      "alias": [
        "diario",
        "susan",
        "diariosusan"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 5,
      "name": "Bigliettino Luke",
      "description": "Luke ha in mano un bigliettino. Chissà cosa ci sarà scritto.",
      "alias": [
        "bigliettino",
        "biglietto",
        "bigliettinoluke",
        "bigliettoluke"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 6,
      "name": "Pezzo di vetro",
      "description": "Un comune pezzo di vetro. Magari in futuro potrebbe servirmi.",
      "alias": [
        "pezzo",
        "pezzo3",
        "pezzo2",
        "pezzo1",
        "pezzodivetro",
        "vetro",
        "pezzovetro"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 7,
      "name": "Metà prisma",
      "description": "Creato dall\u0027unione di due pezzi di vetro.",
      "alias": [
        "metaprisma",
        "meta"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 8,
      "name": "Prisma di vetro",
      "description": "Creato dall\u0027unione di tutti i pezzi di vetro. Riflette perfettamente la luce.",
      "alias": [
        "prismacompleto",
        "prisma",
        "prismavetro"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 9,
      "name": "Computer",
      "description": "Permette di interagire col database della stazione.",
      "alias": [
        "personalcomputer",
        "pc",
        "computer",
        "fisso",
        "portatile"
      ],
      "pickupable": false,
      "usable": true,
      "inUse": false
    },
    {
      "id": 10,
      "name": "Tuta spaziale",
      "description": "Utilizzata da Luke per navigare nello spazio.",
      "alias": [
        "tutaspazio",
        "tutaluke",
        "tuta",
        "tutaspaziale"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "id": 11,
      "name": "Taccuino",
      "description": "Utile per segnarsi ogni dettaglio dell\u0027avventura.",
      "alias": [
        "blocknotes",
        "blocknote",
        "quaderno",
        "quadernino",
        "taccuino",
        "blocconote"
      ],
      "pickupable": true,
      "usable": true,
      "inUse": false
    },
    {
      "content": [],
      "id": 12,
      "name": "Cassa",
      "description": "Permette di contenere vari oggetti.",
      "alias": [
        "chest",
        "ripostiglio",
        "cassa"
      ],
      "pickupable": false,
      "usable": false,
      "inUse": false
    },
    {
      "id": 13,
      "name": "Tastierino",
      "description": "Permette di inserire la password per entrare in Destiny.",
      "alias": [
        "portellone",
        "tastiera",
        "tastierino",
        "codice"
      ],
      "pickupable": false,
      "usable": false,
      "inUse": false
    },
    {
      "id": 14,
      "name": "Tablet",
      "description": "Permette di aprire la botola per l\u0027accesso a Soyuz.",
      "alias": [
        "sportello ",
        "tablet",
        "botola",
        "portellone"
      ],
      "pickupable": false,
      "usable": true,
      "inUse": false
    },
    {
      "id": 15,
      "name": "Controllo braccio robotico",
      "description": "Permette di inserire le matrici di spostamendo per muovere il braccio meccanico.",
      "alias": [
        "controllo",
        "braccio",
        "terminale",
        "tastiera",
        "computer",
        "robot"
      ],
      "pickupable": false,
      "usable": true,
      "inUse": false
    }
  ],
  "notebookText": "",
  "lastCommand": {
    "type": "SAVE",
    "name": "salva",
    "alias": [
      "checkpoint",
      "salvataggio",
      "save"
    ]
  },
  "inventory": {
    "list": [
      {
        "id": 11,
        "name": "Taccuino",
        "description": "Utile per segnarsi ogni dettaglio dell\u0027avventura.",
        "alias": [
          "blocknotes",
          "blocknote",
          "quaderno",
          "quadernino",
          "taccuino",
          "blocconote"
        ],
        "pickupable": true,
        "usable": true,
        "inUse": false
      }
    ]
  },
  "currentRoom": {
    "id": -2,
    "name": "MACCHINA",
    "description": "Finale cattivo.",
    "roomImage": "src/main/resources/img/macchina.png",
    "visible": true,
    "accesed": false,
    "accessible": false,
    "objects": []
  },
  "flagTrapdoor": false,
  "trapdoor": true,
  "aiActive": false,
  "kiboVisited": true,
  "leonardoMusicPlayed": true,
  "firstMusicPlayed": false,
  "currentMusicTrack": "/music/Journey.wav"
}